-- 5-2 Задание 2.
-- п.3 Внесение данных в таблицу
-- ===========================================================
\connect ApressFinancial

insert into "ShareDetails".shareprices
(shareid, price, pricedate)
values
     (1, 2.155,   '2023-08-01 10:10:00')
    ,(1, 2.2125,  '2023-08-01 10:12:00')
    ,(1, 2.4175,  '2023-08-01 10:16:00')
    ,(1, 2.21,    '2023-08-01 11:22:00')
    ,(1, 2.17,    '2023-08-01 14:54:00')
    ,(1, 2.34125, '2023-08-01 16:10:00')
    ,(2, 41.10,   '2023-08-01 10:10:00')
    ,(2, 43.22,   '2023-08-02 10:10:00')
    ,(2, 45.20,   '2023-08-03 10:10:00');

insert into "ShareDetails".shares
(sharedesc, sharetickerid, currentprice)
values ('FAT-BELLY.COM', 'FBC', 45.2000);
